Repository: SmtTheSE/Scholarship_Announcement_Web
Catalog: ucsys_yangon/locale/*/LC_MESSAGES/django.po
Languages: my

source: Deadline
my: ကုန်ဆုံးမည့်ရက်

source: Opportunities
my: အခွင့်အလမ်း

source: Back to
my: နောက်သို့

source: Scholarship Programs
my: ပညာသင်ဆု အစီအစဥ်များ

source: Search scholarships...
my: ပညာသင်ဆုများ ရှာဖွေရန် ...

source: Explore Scholarship Categories
my: ပညာသင်ဆုအမျိုးအစားများ ကြည့်ရှုရန်

source: View Scholarships
my: ပညာသင်ဆုများ

source: UCSY Scholarships
my: UCSY ပညာသင်ဆုများ

source: Explore scholarship opportunities at the University of Computer Studies, Yangon.
my: ရန်ကုန်ကွန်ပျူတာတကွကသိုလ်မှ ပညာသင်ဆုများကြည့်ရန်

source: University of Computer Studies, Yangon
my: ရန်ကုန်ကွန်ပျူတာတက္ကသိုလ်

source: UCSY Logo
my: UCSY တံဆိပ်

source: Welcome to UCSY Scholarships
my: UCSY ပညာသင်ဆုများမှ ကြိုဆိုပါသည်။

source: Explore opportunities for your academic future—locally and abroad.
my: ပြည်တွင်း၊ ပြည်ပ ပညာသင်အခွင့်အလမ်းများကြည့်ရန်
